<div class="dashboard">
  <div class="container">
    <div class="row mt-5 dashboard-row d-flex align-items-stretch">
      <!-- اضافه کردن align-items-stretch -->
      <div class="col-md-3 equal-height right-side">
        <div class="d-flex justify-content-center profile">

          <?php
          // بررسی اینکه آیا کاربر وارد شده است یا خیر
          if (is_user_logged_in()) {
            // دریافت اطلاعات کاربر جاری
            $current_user = wp_get_current_user();

            // نمایش اطلاعات پایه کاربر
          

            // دریافت اطلاعات اضافی (مثلاً نام و نام خانوادگی)
            $first_name = get_user_meta($current_user->ID, 'first_name', true);
            $last_name = get_user_meta($current_user->ID, 'last_name', true);


            // نمایش آواتار کاربر
            echo get_avatar($current_user->ID, 64);
          }

          ?>
          <p class="mt-2 name">sepehr gharei</p>
        </div>

        <a href="">
          <div class="sidebar-item d-flex justify-content-between active">
            <div class="d-flex align-items-center">
              <svg version="1.1" id="Capa_1" xmlns="http://www.w3.org/2000/svg"
                xmlns:xlink="http://www.w3.org/1999/xlink" viewBox="0 0 495.398 495.398" xml:space="preserve">
                <g>
                  <g>
                    <g>
                      <path
                        d="M487.083,225.514l-75.08-75.08V63.704c0-15.682-12.708-28.391-28.413-28.391c-15.669,0-28.377,12.709-28.377,28.391v29.941L299.31,37.74c-27.639-27.624-75.694-27.575-103.27,0.05L8.312,225.514c-11.082,11.104-11.082,29.071,0,40.158c11.087,11.101,29.089,11.101,40.172,0l187.71-187.729c6.115-6.083,16.893-6.083,22.976-0.018l187.742,187.747c5.567,5.551,12.825,8.312,20.081,8.312c7.271,0,14.541-2.764,20.091-8.312C498.17,254.586,498.17,236.619,487.083,225.514z" />
                      <path
                        d="M257.561,131.836c-5.454-5.451-14.285-5.451-19.723,0L72.712,296.913c-2.607,2.606-4.085,6.164-4.085,9.877v120.401c0,28.253,22.908,51.16,51.16,51.16h81.754v-126.61h92.299v126.61h81.755c28.251,0,51.159-22.907,51.159-51.159V306.79c0-3.713-1.465-7.271-4.085-9.877L257.561,131.836z" />
                    </g>
                  </g>
                </g>
              </svg>
              <p class="px-2">داشــبـورد</p>
            </div>
            <? xml ?>
            <!-- Uploaded to: SVG Repo, www.svgrepo.com, Generator: SVG Repo Mixer Tools -->
            <svg viewBox="0 0 1024 1024" class="icon" version="1.1" xmlns="http://www.w3.org/2000/svg">
              <path d="M768 903.232l-50.432 56.768L256 512l461.568-448 50.432 56.768L364.928 512z" />
            </svg>
          </div>
        </a>
        <a href="">
          <div class="sidebar-item d-flex justify-content-between">
            <div class="d-flex align-items-center">
              <? xml ?>
              <!-- Uploaded to: SVG Repo, www.svgrepo.com, Generator: SVG Repo Mixer Tools -->
              <svg version="1.1" id="Capa_1" xmlns="http://www.w3.org/2000/svg"
                xmlns:xlink="http://www.w3.org/1999/xlink" viewBox="0 0 462.949 462.949" xml:space="preserve">
                <g>
                  <path d="M273.053,256.53c9.483,5.334,14.922,12.229,14.922,18.919c0,4.143,3.357,7.5,7.5,7.5s7.5-3.357,7.5-7.5
                          c0-19.359-19.792-35.378-48-41.169v-10.831c0-4.143-3.357-7.5-7.5-7.5s-7.5,3.357-7.5,7.5v8.802
                          c-2.785-0.193-5.617-0.302-8.5-0.302s-5.715,0.11-8.5,0.302v-8.802c0-4.143-3.357-7.5-7.5-7.5s-7.5,3.357-7.5,7.5v10.831
                          c-28.208,5.791-48,21.81-48,41.169s19.792,35.378,48,41.169v56.636c-6.691-1.616-12.821-3.93-18.078-6.887
                          c-9.483-5.334-14.922-12.23-14.922-18.919c0-4.143-3.357-7.5-7.5-7.5s-7.5,3.357-7.5,7.5c0,19.359,19.792,35.378,48,41.169v10.831
                          c0,4.143,3.357,7.5,7.5,7.5s7.5-3.357,7.5-7.5v-8.802c2.785,0.193,5.617,0.302,8.5,0.302s5.715-0.11,8.5-0.302v8.802
                          c0,4.143,3.357,7.5,7.5,7.5s7.5-3.357,7.5-7.5v-10.831c28.208-5.791,48-21.81,48-41.169s-19.792-35.378-48-41.169v-56.636
                          C261.666,251.26,267.796,253.573,273.053,256.53z M189.897,294.368c-9.483-5.334-14.922-12.23-14.922-18.919
                          c0-6.689,5.438-13.585,14.922-18.919c5.257-2.957,11.387-5.27,18.078-6.887v51.611
                          C201.283,299.638,195.154,297.325,189.897,294.368z M231.475,375.949c-2.874,0-5.712-0.115-8.5-0.336v-56.966
                          c2.785,0.193,5.617,0.302,8.5,0.302c2.874,0,5.712,0.115,8.5,0.336v56.328C237.187,375.834,234.349,375.949,231.475,375.949z
                           M273.053,328.53c9.483,5.334,14.922,12.229,14.922,18.919c0,6.688-5.438,13.585-14.922,18.919
                          c-5.257,2.957-11.387,5.27-18.078,6.887v-51.611C261.666,323.26,267.796,325.573,273.053,328.53z M239.975,304.252
                          c-2.785-0.193-5.617-0.302-8.5-0.302c-2.874,0-5.712-0.115-8.5-0.336v-56.328c2.788-0.221,5.626-0.336,8.5-0.336
                          s5.712,0.115,8.5,0.336V304.252z" />
                  <path d="M274.296,149.506c2.937-3.923,4.678-8.79,4.678-14.056c0-8.429-4.463-15.833-11.149-19.981
                          c16.398-11.494,27.149-30.519,27.149-52.019V23.11c0-7.789-3.882-14.999-10.385-19.287s-14.662-5.016-21.817-1.947l-31.298,13.413
                          L200.177,1.876c-7.159-3.068-15.315-2.341-21.817,1.947c-6.503,4.288-10.385,11.498-10.385,19.287v40.339
                          c0,21.5,10.751,40.526,27.149,52.019c-6.685,4.148-11.149,11.551-11.149,19.981c0,5.266,1.741,10.134,4.678,14.056
                          c-71.681,18.97-124.678,84.38-124.678,161.943v64.001c0,48.248,39.252,87.5,87.5,87.5h160c48.248,0,87.5-39.252,87.5-87.5v-64.001
                          C398.975,233.885,345.978,168.476,274.296,149.506z M231.407,143.949h-23.932c-4.687,0-8.5-3.813-8.5-8.5s3.813-8.5,8.5-8.5h23.956
                          c0.014,0,0.028,0.002,0.042,0.002c0.001,0,0.001,0,0.002,0s0.001,0,0.002,0c0.014,0,0.028-0.002,0.042-0.002h23.956
                          c4.687,0,8.5,3.813,8.5,8.5s-3.813,8.5-8.5,8.5h-23.941c-0.016,0-0.031,0-0.047,0h-0.016
                          C231.45,143.949,231.428,143.949,231.407,143.949z M182.975,63.449V23.11c0-2.772,1.327-5.238,3.642-6.764
                          c1.363-0.899,2.891-1.354,4.437-1.354c1.079,0,2.168,0.222,3.216,0.671l34.252,14.68c1.887,0.809,4.021,0.809,5.908,0l34.252-14.68
                          c2.55-1.093,5.338-0.844,7.652,0.684c2.314,1.525,3.642,3.991,3.642,6.764v40.339c0,22.728-15.718,41.846-36.853,47.077
                          l11.317-28.292c1.538-3.846-0.333-8.21-4.179-9.749c-3.842-1.538-8.211,0.331-9.749,4.179l-9.036,22.59l-9.036-22.59
                          c-1.538-3.847-5.906-5.715-9.749-4.179c-3.846,1.539-5.717,5.903-4.179,9.749l11.317,28.292
                          C198.693,105.295,182.975,86.178,182.975,63.449z M383.975,375.449c0,39.977-32.523,72.5-72.5,72.5h-160
                          c-39.977,0-72.5-32.523-72.5-72.5v-64.001c0-79.205,60.7-144.492,138.024-151.808l-7.765,11.647
                          c-2.298,3.446-1.366,8.103,2.08,10.4c1.278,0.853,2.724,1.261,4.153,1.261c2.424,0,4.802-1.173,6.247-3.341l9.76-14.64l9.76,14.64
                          c1.445,2.168,3.823,3.341,6.247,3.341c1.43,0,2.875-0.408,4.153-1.261c3.446-2.298,4.378-6.954,2.08-10.4l-7.765-11.648
                          c77.325,7.315,138.026,72.602,138.026,151.808V375.449z" />
                </g>
              </svg>
              <p class="px-2">خرید اشتــراک</p>
            </div>
            <? xml ?>
            <!-- Uploaded to: SVG Repo, www.svgrepo.com, Generator: SVG Repo Mixer Tools -->
            <svg viewBox="0 0 1024 1024" class="icon" version="1.1" xmlns="http://www.w3.org/2000/svg">
              <path d="M768 903.232l-50.432 56.768L256 512l461.568-448 50.432 56.768L364.928 512z" />
            </svg>
          </div>
        </a>

        <a href="">
          <div class="sidebar-item d-flex justify-content-between">
            <div class="d-flex align-items-center">
              <? xml ?><!-- Uploaded to: SVG Repo, www.svgrepo.com, Generator: SVG Repo Mixer Tools -->
              <svg viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path
                  d="M21.31 9H14.0176C12.351 9 11 10.3431 11 12C11 13.6569 12.351 15 14.0176 15H21.31M14 12V12.01M3.55556 5.72222C4.08333 5.36111 7.77778 5 12 5C16.2222 5 19.9167 5.36111 20.4444 5.72222C20.7556 5.93511 21.0667 7.40107 21.2697 8.75005C21.3207 9.08894 21.3649 9.45201 21.4005 9.83339C21.4637 10.509 21.5 11.2421 21.5 12.0001C21.5 13.1859 21.4111 14.3108 21.2697 15.2501C21.0667 16.599 20.7556 18.0649 20.4444 18.2778C19.9167 18.6389 16.2222 19 12 19C7.77778 19 4.08333 18.6389 3.55556 18.2778C3.02778 17.9167 2.5 14.8889 2.5 12.0001C2.5 11.2421 2.53633 10.509 2.59946 9.83339C2.77694 7.9339 3.16625 5.98859 3.55556 5.72222Z"
                  stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round" />
              </svg>
              <p class="px-2">کیف پول من</p>
            </div>
            <? xml ?>
            <!-- Uploaded to: SVG Repo, www.svgrepo.com, Generator: SVG Repo Mixer Tools -->
            <svg viewBox="0 0 1024 1024" class="icon" version="1.1" xmlns="http://www.w3.org/2000/svg">
              <path d="M768 903.232l-50.432 56.768L256 512l461.568-448 50.432 56.768L364.928 512z" />
            </svg>
          </div>
        </a>
        <a href="">
          <div class="sidebar-item d-flex justify-content-between">
            <div class="d-flex align-items-center">
              <? xml ?>

              <!-- Uploaded to: SVG Repo, www.svgrepo.com, Generator: SVG Repo Mixer Tools -->
              <svg version="1.1" id="Layer_1" xmlns="http://www.w3.org/2000/svg"
                xmlns:xlink="http://www.w3.org/1999/xlink" viewBox="0 0 512 512" enable-background="new 0 0 512 512"
                xml:space="preserve">
                <path
                  d="M410.9,0H85.1C72.3,0,61.8,10.4,61.8,23.3V512L248,325.8L434.2,512V23.3C434.2,10.4,423.8,0,410.9,0z" />
              </svg>
              <p class="px-2">لیست تماشا</p>
            </div>
            <? xml ?>
            <!-- Uploaded to: SVG Repo, www.svgrepo.com, Generator: SVG Repo Mixer Tools -->
            <svg viewBox="0 0 1024 1024" class="icon" version="1.1" xmlns="http://www.w3.org/2000/svg">
              <path d="M768 903.232l-50.432 56.768L256 512l461.568-448 50.432 56.768L364.928 512z" />
            </svg>
          </div>
        </a>
        <a href="">
          <div class="sidebar-item d-flex justify-content-between">
            <div class="d-flex align-items-center">
              <? xml ?>
              <!-- Uploaded to: SVG Repo, www.svgrepo.com, Generator: SVG Repo Mixer Tools -->
              <svg viewBox="0 0 20 20" version="1.1" xmlns="http://www.w3.org/2000/svg"
                xmlns:xlink="http://www.w3.org/1999/xlink">
                <defs></defs>
                <g id="Page-1" stroke="none" stroke-width="1" fill-rule="evenodd">
                  <g id="Dribbble-Light-Preview" transform="translate(-140.000000, -2159.000000)">
                    <g id="icons" transform="translate(56.000000, 160.000000)">
                      <path
                        d="M100.562548,2016.99998 L87.4381713,2016.99998 C86.7317804,2016.99998 86.2101535,2016.30298 86.4765813,2015.66198 C87.7127655,2012.69798 90.6169306,2010.99998 93.9998492,2010.99998 C97.3837885,2010.99998 100.287954,2012.69798 101.524138,2015.66198 C101.790566,2016.30298 101.268939,2016.99998 100.562548,2016.99998 M89.9166645,2004.99998 C89.9166645,2002.79398 91.7489936,2000.99998 93.9998492,2000.99998 C96.2517256,2000.99998 98.0830339,2002.79398 98.0830339,2004.99998 C98.0830339,2007.20598 96.2517256,2008.99998 93.9998492,2008.99998 C91.7489936,2008.99998 89.9166645,2007.20598 89.9166645,2004.99998 M103.955674,2016.63598 C103.213556,2013.27698 100.892265,2010.79798 97.837022,2009.67298 C99.4560048,2008.39598 100.400241,2006.33098 100.053171,2004.06998 C99.6509769,2001.44698 97.4235996,1999.34798 94.7348224,1999.04198 C91.0232075,1998.61898 87.8750721,2001.44898 87.8750721,2004.99998 C87.8750721,2006.88998 88.7692896,2008.57398 90.1636971,2009.67298 C87.1074334,2010.79798 84.7871636,2013.27698 84.044024,2016.63598 C83.7745338,2017.85698 84.7789973,2018.99998 86.0539717,2018.99998 L101.945727,2018.99998 C103.221722,2018.99998 104.226185,2017.85698 103.955674,2016.63598"
                        id="profile_round-[#1342]"></path>
                    </g>
                  </g>
                </g>
              </svg>
              <p class="px-2">ویرایش پروفایل</p>
            </div>
            <? xml ?>
            <!-- Uploaded to: SVG Repo, www.svgrepo.com, Generator: SVG Repo Mixer Tools -->
            <svg viewBox="0 0 1024 1024" class="icon" version="1.1" xmlns="http://www.w3.org/2000/svg">
              <path d="M768 903.232l-50.432 56.768L256 512l461.568-448 50.432 56.768L364.928 512z" />
            </svg>
          </div>
        </a>
        <a href="">
          <div class="sidebar-item d-flex justify-content-between">
            <div class="d-flex align-items-center">
              <? xml ?>
              <!-- Uploaded to: SVG Repo, www.svgrepo.com, Generator: SVG Repo Mixer Tools -->
              <svg viewBox="0 0 32 32" version="1.1" xmlns="http://www.w3.org/2000/svg">
                <path
                  d="M16.5 1.853c-8.133 0-14.75 5.663-14.75 12.624 0.045 2.863 1.132 5.465 2.896 7.45l-0.010-0.012c-0.608 2.418-1.844 4.491-3.525 6.104l-0.004 0.004c-0.22 0.225-0.355 0.534-0.355 0.873 0 0.691 0.56 1.252 1.252 1.252 0.089 0 0.175-0.009 0.259-0.027l-0.008 0.001c3.458-0.576 6.524-1.93 9.121-3.877l-0.054 0.039c1.547 0.517 3.328 0.816 5.179 0.817h0c8.133 0 14.75-5.664 14.75-12.625s-6.617-12.624-14.75-12.624zM16.5 24.602c-0.015 0-0.034 0-0.052 0-1.77 0-3.465-0.321-5.030-0.908l0.099 0.032c-0.045-0.011-0.1-0.020-0.155-0.025l-0.005-0c-0.085-0.025-0.182-0.041-0.283-0.045l-0.002-0c-0.074 0.005-0.142 0.016-0.207 0.033l0.008-0.002c-0.1 0.013-0.19 0.035-0.275 0.068l0.008-0.003c-0.079 0.039-0.146 0.081-0.209 0.129l0.003-0.002c-0.064 0.033-0.118 0.067-0.169 0.105l0.003-0.002c-1.371 1.186-3 2.115-4.789 2.69l-0.098 0.027c0.896-1.391 1.555-3.025 1.872-4.778l0.012-0.082c0.005-0.031-0.005-0.060-0.002-0.092 0.002-0.028 0.003-0.060 0.003-0.093 0-0.311-0.107-0.597-0.286-0.824l0.002 0.003c-0.019-0.023-0.025-0.051-0.046-0.073-1.617-1.608-2.626-3.826-2.652-6.28l-0-0.005c0-5.582 5.495-10.124 12.25-10.124s12.25 4.542 12.25 10.124-5.496 10.125-12.25 10.125zM25 10.75h-16c-0.69 0-1.25 0.56-1.25 1.25s0.56 1.25 1.25 1.25v0h16c0.69 0 1.25-0.56 1.25-1.25s-0.56-1.25-1.25-1.25v0zM16 16.75h-7c-0.69 0-1.25 0.56-1.25 1.25s0.56 1.25 1.25 1.25v0h7c0.69 0 1.25-0.56 1.25-1.25s-0.56-1.25-1.25-1.25v0z">
                </path>
              </svg>
              <p class="px-2">دیـدگــاه ها</p>
            </div>
            <? xml ?>
            <!-- Uploaded to: SVG Repo, www.svgrepo.com, Generator: SVG Repo Mixer Tools -->
            <svg viewBox="0 0 1024 1024" class="icon" version="1.1" xmlns="http://www.w3.org/2000/svg">
              <path d="M768 903.232l-50.432 56.768L256 512l461.568-448 50.432 56.768L364.928 512z" />
            </svg>
          </div>
        </a>
        <a href="">
          <div class="sidebar-item d-flex justify-content-between">
            <div class="d-flex align-items-center">
              <? xml ?>

              <!-- Uploaded to: SVG Repo, www.svgrepo.com, Generator: SVG Repo Mixer Tools -->
              <svg viewBox="0 0 17 17" version="1.1" xmlns="http://www.w3.org/2000/svg"
                xmlns:xlink="http://www.w3.org/1999/xlink">
                <path
                  d="M15.668 6.017c-0.957-3.557-3.863-6.017-7.168-6.017-3.295 0-6.212 2.464-7.168 6.017-0.747 0.082-1.332 0.712-1.332 1.483v4c0 0.625 0.382 1.16 0.924 1.385 0.194 1.747 1.663 3.115 3.461 3.115h2.707c0.207 0.581 0.757 1 1.408 1h3c0.827 0 1.5-0.673 1.5-1.5s-0.673-1.5-1.5-1.5h-3c-0.651 0-1.201 0.419-1.408 1h-2.707c-1.208 0-2.217-0.86-2.449-2h1.064v-1h1v-5h-1v-1h-0.606c0.913-2.961 3.352-5 6.106-5 2.762 0 5.193 2.037 6.106 5h-0.606v1h-1v5h1v1h1.506c0.824 0 1.494-0.673 1.494-1.5v-4c0-0.771-0.585-1.401-1.332-1.483zM8.5 15h3c0.275 0 0.5 0.224 0.5 0.5s-0.225 0.5-0.5 0.5h-3c-0.275 0-0.5-0.224-0.5-0.5s0.225-0.5 0.5-0.5zM2 12h-0.506c-0.272 0-0.494-0.224-0.494-0.5v-4c0-0.276 0.222-0.5 0.494-0.5h0.506v5zM16 11.5c0 0.276-0.222 0.5-0.494 0.5h-0.506v-5h0.506c0.272 0 0.494 0.224 0.494 0.5v4z" />
              </svg>
              <p class="px-2">پشتیبانــی</p>
            </div>
            <? xml ?>
            <!-- Uploaded to: SVG Repo, www.svgrepo.com, Generator: SVG Repo Mixer Tools -->
            <svg viewBox="0 0 1024 1024" class="icon" version="1.1" xmlns="http://www.w3.org/2000/svg">
              <path d="M768 903.232l-50.432 56.768L256 512l461.568-448 50.432 56.768L364.928 512z" />
            </svg>
          </div>
        </a>
      </div>
      <!-- سمت چپ -->
      <div class="col-md-9 equal-height left-side">
        <div class="content mt-5">
          <div class="subscribe item-danger">
            <p>شما اشتراک فعال ندارید</p>
            <a href="">خرید اشتراک</a>
          </div>
          <div class="date-details">
            <div class="item">
              <p>تاریخ عضویت :</p>
              <p><?php $current_user = wp_get_current_user();
              $registration_date = $current_user->user_registered;

              // تبدیل تاریخ به فرمت جلالی
              echo wp_date('Y/m/d ', strtotime($registration_date)); ?></p>
            </div>
          </div>
          <div class="user-details">
            <div class="item">
              <p>ای پی شما :</p>
              <p>

              <?php
              function get_user_ip() {
                if (!empty($_SERVER['HTTP_CLIENT_IP'])) {
                    $ip = $_SERVER['HTTP_CLIENT_IP'];
                } elseif (!empty($_SERVER['HTTP_X_FORWARDED_FOR'])) {
                    $ip = $_SERVER['HTTP_X_FORWARDED_FOR'];
                } else {
                    $ip = $_SERVER['REMOTE_ADDR'];
                }
                return $ip;
            }
            
            // نمایش آی‌پی
            echo   esc_html(get_user_ip());
              ?>
              </p>
            </div>
            <div class="item">

              <p>ایمیل شما :</p>

              <p>

                <?php
                if (is_user_logged_in()) {
                  $current_user = wp_get_current_user();

                  // نام کاربری
                
                  // ایمیل کاربر
                  $email = $current_user->user_email;

                  echo esc_html($email) . '<br>';
                }
                ?>


              </p>
            </div>
            <div class="item">
              <p>نام شما :</p>

              <p>

                <?php
                if (is_user_logged_in()) {
                  $current_user = wp_get_current_user();

                  // نام کاربری
                  $username = $current_user->user_login;

                  // ایمیل کاربر
                
                  echo esc_html($username) . '<br>';
                }
                ?>
              </p>
            </div>
          </div>
          <div class="user-counter">
            <div class="row justify-content-center user-counter-row">
              <div class="item col-12 col-sm-6 col-lg-4">
                <div class="d-flex">
                  <div class="img watch-list">
                    <? xml ?>

                    <!-- Uploaded to: SVG Repo, www.svgrepo.com, Generator: SVG Repo Mixer Tools -->
                    <svg version="1.1" id="Layer_1" xmlns="http://www.w3.org/2000/svg"
                      xmlns:xlink="http://www.w3.org/1999/xlink" viewBox="0 0 512 512"
                      enable-background="new 0 0 512 512" xml:space="preserve">
                      <path
                        d="M410.9,0H85.1C72.3,0,61.8,10.4,61.8,23.3V512L248,325.8L434.2,512V23.3C434.2,10.4,423.8,0,410.9,0z" />
                    </svg>
                  </div>
                  <div class="content-text">
                    <h4>0</h4>
                    <p>لیست تماشا</p>
                  </div>
                </div>
                <div class="show">
                  <p>مشاهده</p>
                </div>
              </div>
              <div class="item col-12 col-sm-6 col-lg-4 ">
                <div class="d-flex">
                  <div class="img comment">
                    <? xml ?>
                    <!-- Uploaded to: SVG Repo, www.svgrepo.com, Generator: SVG Repo Mixer Tools -->
                    <svg viewBox="0 0 32 32" version="1.1" xmlns="http://www.w3.org/2000/svg">
                      <path
                        d="M16.5 1.853c-8.133 0-14.75 5.663-14.75 12.624 0.045 2.863 1.132 5.465 2.896 7.45l-0.010-0.012c-0.608 2.418-1.844 4.491-3.525 6.104l-0.004 0.004c-0.22 0.225-0.355 0.534-0.355 0.873 0 0.691 0.56 1.252 1.252 1.252 0.089 0 0.175-0.009 0.259-0.027l-0.008 0.001c3.458-0.576 6.524-1.93 9.121-3.877l-0.054 0.039c1.547 0.517 3.328 0.816 5.179 0.817h0c8.133 0 14.75-5.664 14.75-12.625s-6.617-12.624-14.75-12.624zM16.5 24.602c-0.015 0-0.034 0-0.052 0-1.77 0-3.465-0.321-5.030-0.908l0.099 0.032c-0.045-0.011-0.1-0.020-0.155-0.025l-0.005-0c-0.085-0.025-0.182-0.041-0.283-0.045l-0.002-0c-0.074 0.005-0.142 0.016-0.207 0.033l0.008-0.002c-0.1 0.013-0.19 0.035-0.275 0.068l0.008-0.003c-0.079 0.039-0.146 0.081-0.209 0.129l0.003-0.002c-0.064 0.033-0.118 0.067-0.169 0.105l0.003-0.002c-1.371 1.186-3 2.115-4.789 2.69l-0.098 0.027c0.896-1.391 1.555-3.025 1.872-4.778l0.012-0.082c0.005-0.031-0.005-0.060-0.002-0.092 0.002-0.028 0.003-0.060 0.003-0.093 0-0.311-0.107-0.597-0.286-0.824l0.002 0.003c-0.019-0.023-0.025-0.051-0.046-0.073-1.617-1.608-2.626-3.826-2.652-6.28l-0-0.005c0-5.582 5.495-10.124 12.25-10.124s12.25 4.542 12.25 10.124-5.496 10.125-12.25 10.125zM25 10.75h-16c-0.69 0-1.25 0.56-1.25 1.25s0.56 1.25 1.25 1.25v0h16c0.69 0 1.25-0.56 1.25-1.25s-0.56-1.25-1.25-1.25v0zM16 16.75h-7c-0.69 0-1.25 0.56-1.25 1.25s0.56 1.25 1.25 1.25v0h7c0.69 0 1.25-0.56 1.25-1.25s-0.56-1.25-1.25-1.25v0z">
                      </path>
                    </svg>
                  </div>
                  <div class="content-text">
                    <h4>
                      <?php 
                      if (is_user_logged_in()) {
                        $current_user_id = get_current_user_id();
                        
                        // دریافت تعداد کامنتهای کاربر
                        $comment_count = get_comments(array(
                            'user_id' => $current_user_id,
                            'count'   => true, // فقط تعداد را برگردان
                            'status'  => 'approve' // فقط کامنتهای تاییدشده
                        ));
                        
                        echo   esc_html($comment_count);
                    } 
                      ?>
                    </h4>
                    <p>کامنت ها</p>
                  </div>
                </div>
                <div class="show">
                  <p>مشاهده</p>
                </div>
              </div>
              <div class="item col-12 col-sm-6 col-lg-4 ">
                <div class="d-flex">
                  <div class="img ticket">
                    <svg viewBox="0 0 17 17" version="1.1" xmlns="http://www.w3.org/2000/svg"
                      xmlns:xlink="http://www.w3.org/1999/xlink">
                      <path
                        d="M15.668 6.017c-0.957-3.557-3.863-6.017-7.168-6.017-3.295 0-6.212 2.464-7.168 6.017-0.747 0.082-1.332 0.712-1.332 1.483v4c0 0.625 0.382 1.16 0.924 1.385 0.194 1.747 1.663 3.115 3.461 3.115h2.707c0.207 0.581 0.757 1 1.408 1h3c0.827 0 1.5-0.673 1.5-1.5s-0.673-1.5-1.5-1.5h-3c-0.651 0-1.201 0.419-1.408 1h-2.707c-1.208 0-2.217-0.86-2.449-2h1.064v-1h1v-5h-1v-1h-0.606c0.913-2.961 3.352-5 6.106-5 2.762 0 5.193 2.037 6.106 5h-0.606v1h-1v5h1v1h1.506c0.824 0 1.494-0.673 1.494-1.5v-4c0-0.771-0.585-1.401-1.332-1.483zM8.5 15h3c0.275 0 0.5 0.224 0.5 0.5s-0.225 0.5-0.5 0.5h-3c-0.275 0-0.5-0.224-0.5-0.5s0.225-0.5 0.5-0.5zM2 12h-0.506c-0.272 0-0.494-0.224-0.494-0.5v-4c0-0.276 0.222-0.5 0.494-0.5h0.506v5zM16 11.5c0 0.276-0.222 0.5-0.494 0.5h-0.506v-5h0.506c0.272 0 0.494 0.224 0.494 0.5v4z" />
                    </svg>
                  </div>
                  <div class="content-text">
                    <h4>0</h4>
                    <p>تیکت ها</p>
                  </div>
                </div>
                <div class="show">
                  <p>مشاهده</p>
                </div>
              </div>
            </div>
          </div>
        </div>
      </div>

      <!-- سمت راست -->
    </div>
  </div>
</div>